{
    "question": "vocabulaire C",
    "questionnaire": [
        {
            "definition": "Suite d'instruction qui permet d'obtenir un résultat.",
            "traduction": "algorithme"
        },
        {
            "definition": "Données que le programme reçoit par les différents périphériques.",
            "traduction": "entrée"
        },
        {
            "definition": "Données que le programme affiche/retourne.",
            "traduction": "sortie"
        },
        {
            "definition": "Fichier qui contient le code brute.",
            "traduction": "fichier source"
        },
        {
            "definition": "Forme finale du fichier, après compilation.",
            "traduction": "fichier du programme exécutable"
        },
        {
            "definition": "Fichier résultant de la compilation d'un code source, mais il n'est pas encore directement exécutable.",
            "traduction": "fichier de code objet"
        },
        {
            "definition": "Fichier qui contient des déclaration de fonctions, de classes de variables, et d'autres éléments de programme.",
            "traduction": "fichier d'en-tête"
        },
        {
            "definition": "Outil logiciel qui transforme un code source écrit dans un langage de programmation de haut niveau (comme C++, Java, etc.) en un code de bas niveau (souvent appelé langage machine) que l'ordinateur peut exécuter directement.",
            "traduction": "compilateur"
        },
        {
            "definition": "Il lit le code `exemple.o` pour y trouver des références à des bibliothèques.",
            "traduction": "lieur"
        },
        {
            "definition": "Ensemble de code pré-écrit et organisé, regroupant des fonctions, classes, ou modules, qui offrent des fonctionnalités spécifiques et réutilisables dans différents programmes.",
            "traduction": "librairie"
        },
        {
            "definition": "Instruction spéciale qui indique au compilateur comment traiter le code source pendant la phase de compilation.",
            "traduction": "directive de compilation"
        },
        {
            "definition": "Equivalence littérale de quelque chose d'autre dans le code.",
            "traduction": "constante"
        },
        {
            "definition": "Donnée dont la valeur ne peut pas être modifiée après sa déclaration et son initialisation.",
            "traduction": "constante"
        },
        {
            "definition": "Construction de la notation d'une instruction.",
            "traduction": "format générique"
        },
        {
            "definition": "tout caractère (caractère de contrôle ou spéciaux) que l'on ne peut pas saisir directement dans le code source.",
            "traduction": "séquence d'échappement"
        },
        {
            "definition": "Suite de caractères spécifique utilisés dans les chaîne de caractères pour afficher des valeurs dans un format spécifique.",
            "traduction": "formateur"
        },
        {
            "definition": "Valeur directement indiqué dans le code source, soit par un littéral soit par une constante.",
            "traduction": "valeur immédiate"
        },
        {
            "definition": "Façon d'enregistrer un nombre : signe - mantisse - exposant.",
            "traduction": "format scientifique"
        },
        {
            "definition": "Instruction qui associe un nom (un identificateur) à un type de données, et peut spécifier d'autres attributs comme sa portée et sa durée de vie.",
            "traduction": "déclaration"
        },
        {
            "definition": "Symbole servant d'abréviation pour une véritable fonction.",
            "traduction": "macro"
        },
        {
            "definition": "Ecrire son code en écrivant toutes les fonctions secondaires après la fonction principale",
            "traduction": "top-down"
        },
        {
            "definition": "Ecrire son code en écrivant toutes les fonctions secondaires avant la fonction principale.",
            "traduction": "bottom-up"
        },
        {
            "definition": "Opérateurs qui évaluent leurs opérandes de gauche à droite, mais n'évaluent pas nécessairement tous les opérandes.",
            "traduction": "opérateur court-circuit"
        },
        {
            "definition": "Condition ||",
            "traduction": "disjonction"
        },
        {
            "definition": "Condition &&",
            "traduction": "conjonction"
        },
        {
            "definition": "Ensemble d'actions qui peut se dérouler plusieurs fois tant qu'une condition reste vérifiée.",
            "traduction": "boucle"
        },
        {
            "definition": "..., n'a besoin que d'une seule valeur pour réaliser l'opération.",
            "traduction": "opérateur unaire"
        },
        {
            "definition": "..., a besoin de deux valeurs pour réaliser l'opération.",
            "traduction": "opérateur secondaire"
        },
        {
            "definition": "..., a besoin de trois valeur pour réaliser l'opération.",
            "traduction": "opérateur tertiaire"
        },
        {
            "definition": "Groupe d'instructions délimité par des accolades.",
            "traduction": "bloc d'instructions"
        },
        {
            "definition": "On code en découpant les éléments de manière précise.",
            "traduction": "programmation modulaire"
        },
        {
            "definition": "On code en utilisant des fonctions combinées à d'autres fonctions.",
            "traduction": "programmation fonctionnelle"
        },
        {
            "definition": "On code en ajoutant ajoutant des modules.",
            "traduction": "programmation séquentielle"
        },
        {
            "definition": "Zone mémoire temporaire qui contient une donnée qui peut changer du début à la fin de l'exécution du programme.",
            "traduction": "variable"
        },
        {
            "definition": "La valeur même d'une variable.",
            "traduction": "littéral"
        },
        {
            "definition": "Définit la façon dont les données seront stockées en mémoire.",
            "traduction": "type de variable"
        },
        {
            "definition": "Consiste à associé une valeur à une variable.",
            "traduction": "initialisation"
        },
        {
            "definition": "Action de forcer une variable à être considérée à être d'un autre type que son type de naissance.",
            "traduction": "transtypage"
        },
        {
            "definition": "Variable déclarée et utilisée dans une fonction. La valeur et la variable disparaissent en fin d'exécution de la fonction.",
            "traduction": "variable locale"
        },
        {
            "definition": "Variable déclarée et utilisée dans une fonction. La valeur et la variable ne disparaissent pas en fin d'exécution de la fonction.",
            "traduction": "variable statique"
        },
        {
            "definition": "Variable qui peut être atteinte par toutes les fonctions d'un programme. Elle conserve constamment sa valeur.",
            "traduction": "variable globale"
        },
        {
            "definition": "Mot clé servant à influer sur le mode de création en mémoire des variables.",
            "traduction": "auto"
        },
        {
            "definition": "Mot clé servant à définir une constante.",
            "traduction": "const"
        },
        {
            "definition": "Mot clé permettant de créer une liste énumérée.",
            "traduction": "enum"
        },
        {
            "definition": "Mot clé permettant d'obliger le compilateur à stocker la valeur d'une variable dans un registre du processeur.",
            "traduction": "register"
        },
        {
            "definition": "Mot clé. C'est une structure de données dans laquelle plusieurs éléments partagent le même espace, ce qui permet d'y accéder sous plusieurs noms de variables différents.",
            "traduction": "union"
        },
        {
            "definition": "Mot clé servant auparavant à optimiser le code indiquant au compilateur que la variable ainsi désignée risquait de changer par une cause extérieure au programme.",
            "traduction": "volatile"
        },
        {
            "definition": "Ensemble de valeurs de même type, portant le même nom de variable.",
            "traduction": "tableau"
        },
        {
            "definition": "Valeur représentant l'emplacement d'une valeur dans un tableau.",
            "traduction": "indice"
        },
        {
            "definition": "Tableau dont tous les éléments sont du même type.",
            "traduction": "tableau homogène"
        },
        {
            "definition": "Tous les éléments sont consécutifs en mémoire.",
            "traduction": "tableau séquentielle"
        },
        {
            "definition": "Façon d'atteindre un élément via un indice.",
            "traduction": "accès direct"
        },
        {
            "definition": "Espace mémoire alloué de façon statique",
            "traduction": "taille fixe"
        },
        {
            "definition": "Chaîne de caractère qui se termine par une valeur nulle pour indiquer la fin de la chaîne.",
            "traduction": "chaîne à zéro terminal"
        },
        {
            "definition": "Symboles utilisé pour réaliser des opérations",
            "traduction": "opérateur"
        },
        {
            "definition": "Suite de plusieurs caractères ou valeur de n'importe quel type.",
            "traduction": "chaîne"
        },
        {
            "definition": "Autre nom pour définir une fonction.",
            "traduction": "module"
        },
        {
            "definition": "Désigne une option ou une valeur.",
            "traduction": "argument"
        },
        {
            "definition": "Valeurs/litéraux ou nom de variable dont la valeur sera transmise à la fonction lorsqu'elle sera appelée (déclenchée).",
            "traduction": "argument de fonction"
        },
        {
            "definition": "Ce sont les valeurs ou littéraux utilisée/située dans les parenthèse d'une fonction, que ce soit lors de l'appel, dans le prototype ou la fonction elle même.",
            "traduction": "argument d'entrée"
        },
        {
            "definition": "Valeur renvoyée par une fonction.",
            "traduction": "valeur de retour"
        },
        {
            "definition": "Fait d'initialiser plusieurs variable en même temps sur une seule ligne.",
            "traduction": "initialisation groupé"
        },
        {
            "definition": "Etapes successives de saisie puis de réaction.",
            "traduction": "approche évenementielle"
        },
        {
            "definition": "Le programme considère que les données en entrée arrivent sous forme d'un flot continu.",
            "traduction": "entrée flux"
        },
        {
            "definition": "Paramètre que l'on envoi à la fonction (présent dans le prototype).",
            "traduction": "paramètre effectif"
        },
        {
            "definition": "Valeur situé dans les parenthèse de l'appel de la fonction.",
            "traduction": "paramètre formel"
        },
        {
            "definition": "Fonction qui ne renvoi rien. Elle peut recevoir des arguments.",
            "traduction": "procédure"
        },
        {
            "definition": "Fait référence à la déclaration d'une fonction, qui comprend son nom, le type de retour et la liste des paramètres.",
            "traduction": "signature"
        },
        {
            "definition": "Est le nom que l'on donne à une structure.",
            "traduction": "type de structure"
        },
        {
            "definition": "Ce sont les variables qui se situent à l'intérieur des accolades de corps de définition d'une structure.",
            "traduction": "membre de structure"
        },
        {
            "definition": "Variable dont le type est associé à une structure.",
            "traduction": "variable de structure"
        },
        {
            "definition": "Déclaration de plusieurs variable de structure sous forme de tableau.",
            "traduction": "tableau de structure"
        },
        {
            "definition": "Représente la notation utilisée lorsque que l'on souhaite atteindre une variable d'une structure.",
            "traduction": "notation de structure à point"
        },
        {
            "definition": "Nom donné à une structure pour l'identifier.",
            "traduction": "étiquette"
        },
        {
            "definition": "Initialisation d'une structure.",
            "traduction": "définition d'une structure"
        },
        {
            "definition": "Structure qui contient les énumérateurs.",
            "traduction": "type énuméré"
        },
        {
            "definition": "Constantes situées à l'intérieur du type énuméré.",
            "traduction": "énumérateur"
        },
        {
            "definition": "Valeur entière associée à chaque énumérateur d'un type énuméré.",
            "traduction": "identificateur"
        },
        {
            "definition": "Equivalent des membres dans une structure, mais dans une énumération.",
            "traduction": "champs"
        }
    ]
}