{
  "1": {
    "titre": "Course à Pied ECOrrida de namur 5 km",
    "tags": [
      "genant",
      "course_a_pied"
    ],
    "note": "Aujourd'hui c'était l'ECOrrida. Une corrida de 5 et 10 km organisé par le cercle ECO. On me l'a rappelé au diner parce que sinon je serai complètement passé à coté. J'y suis aller. J'ai payer sur place 6€ pour les 5km. Au moment de payer, j'étais pas perdu mais c'était ma première fois quand même et j'étais pas à l'aise. Au moment de me tendre le dossard, toutes les cartes de mon portefeuille sont tombée par terre. Génant, mais sans plus, j'ai l'habitude de ce genre de trucs. J'étais seul. Donc je suis pas resté. J'étais venu dé l'ouverture des inscriptions à 14h. Et le départ était à 15h. Donc je suis parti faire un petit échauffement de 3km à 4:30/km. Je suis repassé au kot pour déposer mes affaires, mettre mon dossard. Je partais le plus légé possible. Je suis arrivé 20min en avance sur la ligne de départ. Il y avait du monde. J'étais seul et j'avais pas de poche et pas de GSM. Ces 20 minutes ont été très longues. Vraiment j'étais très seul. Il y avait une seule personne que je connaissait, c'était Clémence, et j'avais pas envie de la dérangée, elle était sûrement avec d'autres personnes. Puis la course à commencée. Il y avait un peu d'ambiance, j'y ai participé, fallait bien que je m'incruste un peu. Puis le départ est lancé. Toujours un peu plus vite que le reste de la course. C'était fun, sauf une fille qui m'a coupé la priorité pour donné je sais pas quoi à quelqu'un sur le côté. Pas malin. J'avais pas de chrono en tête. Même si j'espérais un peu passé sous les 20 minutes. Mais j'ai suivi le mouvement. Beaucoup de virage, un circuit que je ne connais pas, des pavés dans un sale état à certains endroit. EN arrivant, j'avais vite compris que le podiium était hors d'atteinte. Au final 4,8 km à du 4:11/km. Pas mal, je suis content de moi, en sachant que j'aurais pu faire un petit peu mieux. Pas sûr que j'aurais pu passer sous les 20 min, mais content quand même. J'ai pris mon verre d'eau à l'arrivée (pas très rempli le verre) et je suis parti parce qu'il me fallait de l'argent pour les 10 km. Ouais je sais, mais ça c'est dans une autre note."
  },
  "2": {
    "titre": "Course à Pied ECOrrida de Namur 10 km",
    "tags": [
      "genant",
      "course_a_pied"
    ],
    "note": "Je venais de finir les 5 km que je devais de nouveau courir pour participer au 10 km. J'avais pas d'argent pour prendre le dossard des 10 km. J'avais 20 min devant moi. Le départ des 10 km se faisait à 15h45. J'ai couru jusqu'au kot, j'ai pris ma carte de banque et déposé mon gobelet. Puis j'ai couru jusqu'au distributeur de billet près de Mr Wu. Puis j'ai couru jusqu'à l'inscription. Ca me fait facilement 2 km. Lorsque je suis arrivé devant l'inscription, avec ma carte de banque, mes 20€ et mon badge, elle m'a dit qu'il fallait se réinscrire avec son GSM. Pour s'inscrire, il fallait scanner un QR code et entrer ces informations pour obtneir un dossard. Sauf que je n'avais pas de GSM. Elle m'a gentillement prèté le sien et je me suis inscrit grâce à elle. Il ne restait que 5 minute au moment ou je suis venu m'inscrire. Je lui avait au préalable, demandé si il était toujours possible de venir m'inscire au 10 km après les 5 km. Avec une mauvaise connexion et un site lent, on a galéré à m'enregistrer. J'avais qu'un billet de 20 (je pouvais pas retiré moins) et je lui ai dit de gardé les 2€ (je voulais pas courir avec une pièce dans la main. Déjà que j'avais pas de poche et une main déjà pleine. J'ai obtenu mon dossard et je me suis assis pour remplacé celui des 5 km par celui des 10 km. Problème, je ne peux pas courir avec celui des 5 km en main, il risque d'y avoir des prblèmes au portique d'enregistrement des chronos. Je voulais pas créer de problème. Tout à coup, Clémence qui m'avait apercu est venue me parler pour savoir si ça avait été. J'ai dit que oui et je lui ai finalement demandé si par hasard, elle pouvait me garder le dossard des 5 km. Elle avait couru les 5 km et je l'avais croisée sur le premier km, mais je n'avais rien dit, j'avais peur d'être gênant. Elle a acceptée de garder mon dossard et je suis parti vers la ligne d'arrivée. J'ai sprinté vers la ligne d'arrivée. J'étais presque le dernier. Un homme est arrivé juste après moi pour s'inscrire également. J'étais le seul avec des lunettes de soleil. Je suis vite gêné vous comprenez, donc les lunettes de soleil ça m'aide quand il y a de la foule. Le départ à eu lieu, et j'ai vu les premiers partir comme des flèches. Moi je faisait les 10 km sans chrono dans le viseur, je venais de courir toute la journée, je voulais faire ça chill. Alors je commence à suivre des gens, puis je passe à ceux de devant, et encore, et encore. J'aime pas resté trop longtemps derrière les gens, surtout quand ils sont seuls. Je suis vite gêné vous comprenez, et j'ai tendance à collé un peu trop. Donc au final, je me retrouve à courir plus vite que ce que je ne le veux. Je me retrouve avec une allure finale de 4:37/km pour 9,7 km. Pas mal en vrai, après tout ce que j'ai fais. Comme un con, la ligne d'arrivée est séparée en 2, il y a un petit couloir sur la gauche où les finisheurs sont censés passé afin de ne pas gêné les autres. Mais moi, vous le savez, je suis vité gêné et vite gênant. Alors je suis passé du côté droit alors que j'avais fini. Quel con, j'étais tout content parce que j'arrivais plus ou moins frais. Et la il fallait que je gâche tout. En soit, il n'y a pas mort d'homme, il n'y avait personne derrière moi. avant une centaine de mètres. Le circuit était une boucle de 2,4 km. Il était pas mal, j'ai bien aimé. La police était la pour bloqué les routes et le staff était énorme pour une corrida. Il y avait de la musique à plusieurs endroits. Franchement top la journée. A la fin des 10 km, je suis allé dans le parking sans aucune raison, je n'avais pas mon GSM et je ne connaissait personne. Je n'avais pas non plus l'intention d'acheter de boissons au bar. Et la, Clémence est revenue vers moi. Elle était encore la. Elle était avec son amie. La musique était vraiment forte. j'arrivais à l'entendre, mais pas son amie. Elle m'a parlé 2 fois mais je n'ai jamais compris ce qu'elle m'avait dit. Je suis encore plus gênant dans cette situation. J'ai à chaque fois souris et répondu un truc bateau. Heureusement ert malheureusement, on a pas discuté longtemps. En y repensant j'aurais pu lui offrir un vers, j'avais 10€ dans la main. Mais c'est comme ça, c'est tout moi. Je lui ai au moins dit qu'on se reverrai ce soir. Mais les chances sont faibles. Je me sentais pas trop à ma place au milieu de tout ces gens, même si l'ambiance était super sympa. Il y avait de coureur de tout âge. Des gens qui encourageaient. Malheureusement ils encourageaient plus les 1ère et 2ème fille qui était avec moi sur une bonne partie du parcours que moi. Avec moi, il n'y avait pas souvent d'applaudissement. Je comprends, quand j'y repense, tout ce que je faisait, c'est un signe de main. Un peu gênant, je savais pas quoi dire d'autre. J'ai eu un autre moment gênant sur les 10 km. Je suivais un groupe de personne qui semblaient courir à du 5:00/km. Je partais sur cette allure au départ. Et, vous le savez bien, ma respiration est plutôt calme sur une allure de 4:15 et plus. Lorsqu'est venu le moment de les dépassé, j'avais une bonne foulée et aucun bruit de respiration. En les dépassant, ils ont fais 2 trois commentaire entre eux pour mentionner ma facilité sur le parcours. La seule chose que j'ai trouvé à répondre (parce que j'ai tout de même répondu à ces gens, ce qui est miraculeux), c'est : Mais si, je suis essouflés (avec un petit sourire). Je suppose que ça ne le donne pas très bien à l'écrit, et que cela ne devait être aussi gênant au final, mais j'ai trouvé que c'était plutôt gênant pour moi. Alors j'ai accéléré. Ils avaient mentionné un peu plus tôt leur difficulté dû à leur sortie au bunker de la veille. J'aurais pu leur dire que moi, je n'étais pas sorti avec un petit sourire, mais trop tard, j'étais déjà au kot quand j'ai trouvé cette réponse. Je les ai croisé au moment de rentré. Ils m'ont vu également, mais je ne me suis pas arrêté. J'aurais pu leur dire à ce moment la, mais non... C'est comme ça. Ma vie est comme ça. Comme le fait de courir derrière une fille alors qu'il y a des spectateurs. Je me sent comme un gros pédophile alors que je regarde rien. Mais bon, c'est comme ça. La journée était tout de même superbe."
  }
}