{
  "histoire": [
    {
      "titre": "résumé de cette semaine de merde (on est mercredi)",
      "tags": ["kot","coli","informatique","probleme"],
      "texte": "Je ne sais pas ce que je vais dire, mais je sais qu'il y a beaucoup à dire. Commençont par ce putain d'ordinateur de merde qui a décidé de me lâcher ne plein milieu du mois de Novembre. Putain, 2 mois avant les examens, ce putain d'ordinateur décide de me lâcher. Il va falloir que je remplace un composant. Et vous savez très bien que c'est la merde niveau argent. J'ai plus d'argent, bah oui parce que j'ai acheté cette superbe télé qui en met plein la vue. Mais c'est pas le genre de truc que je peux dire à nimporte qui. Parce que TOUT LE MONDE va me dire de trouver un putain de job étudiant. Mais ce que ces TDC peuvent pas comprendre, c'est qu'on est a 2 mois des examens et que c'est vraiment la merde. Quel est le TDC qui trouverait un job étudiant maintenant ? Dite le moi. J'ai pas le temps. Et pour tous ceux qui me disent que j'aurai pas du acheter la télé et que j'aurais économiser pour prévoir ca. AH parce que ca vous ARRIVE SOUVENT DE PREVOIR QUE VOTRE ORDINATEUR VOUS LACHE DANS LES MAINS QUAND TOUT VA BIEN ? Ah vous les prévoyez souvent les imprévus vous ? Putain, j'ai attendu des mois entier pour acheter cette putain de télé. Personne peut m'en vouloir. Mais malgré toute ces excuses, tout le monde va me dire que j'aurai du travailler plus avant. ALLEZ TOUS VOUS FAIRE FOUTRE. Donc je peux pas me peremttre d'aller voir un professionnel parce qu'il me facturerait l'analyse du PC et que je viens de vous dire que je n'ai plus d'argent. Ca c'est le problème N°1, et j'ai pas envie d'en parler aux autres parce qu'ils vont me dire que j'avais déjà eu des problèmes avec le PC avant et nanani et nanana, ... Je m'en BLC, je sais et je veux rester avec mon PC. NVM. Problème N°2, les colis. A ces fameux colis de merde. Voyez-vous maintenant que mon PC est HS. Je dois un peu brancher - débrancher - rebrancher, ... Et donc c'est la qu'intervient les câbles Ethernet. Je dois constamment débrancher mon câble Ethernet entre mon portable et ma tour, parce que je n'ai pas d'autres câble Ethernet. Et dans ce cas la, si j'en parle aux autres, ils vont me dire que j'aurais du acheter le WIFI de Bouvier pour 35€. OUAIS, 35€ pour avoir du WIFI qui pue la merde. Je le sais parce que tout le monde se plaint de la qualité du WIFI chez Bouvier. Pourquoi je prendrai le WIFI si c'est pour avoir un débit de 3 Mo alors que j'en ai 70 Mo en Ethernet ??? Allez-y dite le moi... Donc je suis la à jouer avec les câbles. Et la, je me dit que ça aurait pu être beaucoup plus simple si j'avais les 3 câbles Ethernet que j'ai commandé sur LDLC il y a 3 semaines. N'est-ce pas ? Mes pourquoi est-ce que je n'ai pas ces câbles Ethernet ? Peut être parce que j'ai voulu me les faire livrer dans un point relais à Namur. Ce fameux ptn de point relais. J'avais déjà commandé avec Amazon à ce point relais, et tout c'était bien passé. Comment étais-je sensé savoir qu'il n'acceptait pas les colis livré par DPD ? Et comment étais-je sensé savoir que la société de livraison Chronopost en France s'appelait DPD en belgique ? Bah oui, quand il passe la frontière, ils portent des noms différents. Donc je suis bien gentillement rentré chez moi sans mes colis. Donc j'ai décidé de me renseigner un peu. J'ai consulté le suivi de mes colis et j'ai pris un autre rdv via le site. Il me proposait un rdv le lendemain à la même heure. De 13h44 à 14h44. C'est une plage assez courte n'est-ce pas ? J'avais commandé le colis il y a déjà une semaine de ça. Donc je prend rdv et je passe 1h15 devant la porte de mon kot à attendre la camionette de livraison qui n'est JAMAIS passée... Oui, en sachant que mon GSM n'avait plus de batterie les 20 dernières minutes et que j'ai attendu sans GSM et sans musique. Je ne pouvais pas remonter au risque de louper la livraison. Donc encore une fois, j'ai pas eu mes colis. Dans le suivi de ceux-ci, il était indiqué : colis refusé. Comment j'aurais pu le refusé si il est même pas passé ? De plus qu'est-ce que je vois... Il ne m'est plus possible de prendre de rdv, parce que le colis est sur le chemin du retour à l'expéditeur, LDLC. Bref je prend mon seum et je préviens LDLC qui avait une procédure pour ce genre de cas. Ils ont simplement renvoyé le colis à nouveau. Mais a mon adresse de la maison cette fois. On parle bien de 2 colis, mes câbles à moi et les 2 caméra dans un autre colis. Ils ont toujours voyagé ensemble depuis le début. Sauf que comme par hasard, sur se second envoi, mon colis contenant les câbles dont j'avais besoin a été \"retardé\". C'est ce qu'ils disent sur le site. Je n'avais plus de date de livraison prévue. J'ai reçu les caméra, mais pas mes câbles. Et au moment ou je rentre au kot, pour bien me narguer, je reçois le colis le jour d'après, lundi. Ca faisait déjà 2 semaines et je devais maintenant attendre une semaine de plus. Faut vraiment que j'aille me faire enculer je pense. Si je joue au loto, je suis capable de perdre 32 millions d'euro. Supplémént ma chaise de bureau qui commence à descendre toute seule a cause de l'usure. Chaque jour, je dois la remontée. Ca c'est pas un problème trè important. Voici un autre problème. N°3 : Lorsque papa a créé un compte spotify, il a prit un DUO. C'est un compte qui peut accepter 2 personnes différentes. Comme il n'écoutait jamais de musique avec spotify, il m'a laissé utilisé son compte et maman avait le sien. Pendant 2 ans, tout allait bien, j'écoutait ma musique sans problème et tout. Mais depuis qu'il a du acheté la Volvo et qu''il y a plein d'option dont spotify dans cette voiture... Il a commencé à écouter de la musique. Sauf qu'on a le même compte... Il faut savoir que moi, j'écoute beaucoup de musique, j'ai toute mes playlist, mes titres likés, etc. J'écoute ne moyenne 4h de musique par jour. Donc c'est pas mal en sachant qu'on peut retirer 9h de sommeil. Donc maintenant que papa écoute sa musique qavec spotify, ma musique s'arrête à des moments random de la journée pour passer sur le gsm de papa ou la volvo... Je vous raconte pas comment c'est chiant pour les gens qui savent de quoi je parle. Il faut savoir que l'abonnement est associé à l'adresse mail de papa. Je me suis un peu renseigné aujourd'hui sur les différents abonnement qu'il y avait sur spotify et j'ai remarqué qu'il y avait un abonnement Etudiant. Je me suis dit génial, un abonnement Etudiant pour 7€ par mois. J'ai vérifier avec le site si mes conditions me peremttait d'avoir l'abonnement, et est venu un moment où il m'a demandé si ce profil (le profil de mon père) était le \"bon\" ? Je pensais qu'il voulait transférer mes playlist du compte de mon père à mon nouveau compte. Parce qu'il faut savoir que les seules adresse mail que j'ai renseigné pour voir si j'étais élligible à l'offre était mon adresse personnelle et mon adresse étudiante. Et il s'est avéré qu'il a tout simplement modifier l'abonnement du compte de papa pour choisir l'abonnement étudiant. Donc le 1er Décembre, papa va payer grâce à mon avantage et le compte de maman sera viré de l'abonnement parce que c'est que pour 1 personne. Mais putain de bordel de merde. Qu'est-ce que c'est que cette connerie encore ? Comment est-ce qu'il est parvenu à choisir le compte de mon père alors que je lui parle du miens ? Bref, il a fallu que j'envoi un message dans le groupe. Moi je voulais pas en parler parce que dans ma famille, ils seraient capable de me voir \"mal\" parce que \"pour une fois que papa écoute de la musique avec SON compte que LUI paye.\" Oui bah moi j'ai pas eu mon mot à dire lorsque j'ai du utiliser son compte ET oui ca casse cite les couilles quand on coupe ta musique de manière aléatoire, mais ils peuvent pas comprendre vu que ca ne leur arrive pas. Et ils vont aussi me dire \"Tu va payer ton compte avec quel argent ? T'en a pas. Tu va encore le payer avec l'argent que maman te verse hein ?\". Bah oui, j'ai plus d'argent, mais 7€ par mois ca va tuer personne. J'arrêterai de prendre des donuts quand je vais au delhaize, moi aussi je sais faire des compromis. Et puis oui, j'ai économiser pour acheter une télé. Vous savez les prévoir vous les imprévu ? Qui a décidé que mon PC allait tombé en panne cette semaine ? Qui a décidé que papa déciderait d'utiliser son compte spotify à partir de Novembre ? Moi j'aimerais bien savoir comment ils auraient prévu ce genre de chose hein. Bref, c'est une belle grosse semaine de merde. J'espère qu'au moment ou vous lisez cette note, ca va mieux de votre côté. Mes problèmes peuvent paraître futile pour certains mais moi c'est mes problèmes et faut tout de même que je fasse avec, parce que de ce que je sais, les problèmes on peut pas encore les faire disparaître en les ignorants."
    }
  ]
}