{
    "histoire": [
        {
            "titre": "cours de ce matin",
            "tags": ["ecole", "genant", "conge"],
            "texte": "Encore une fois, j'ai eu du mal de me lever. Toujours pareil. Les ptn de cours à 8h30 au matin, j'ai 3 jours de cours, 14h au total. Et ils commence tous à 8h30. Et se suive sans trou dans l'horaire. C'est comme ca à chaque fois. J'ai eu Sécurité Informatique labo. On a du se connecter à un nouveau truc pour faire des exercices. On était livré à nous même. C'était un battle royal. Personne demande au prof parce que c'est comme ca. Comme une règle sociale. Il est la mais il se fait chier. J'ai galéré à me connecter. J'y suis arrivé et j'ai galéré sur les exercices. Encore une fois, la théorie pue la merde et n'a aucun rapport avec les labos. Du coup, on se retrouve face à un exercices inconnu, sur une matière inconnue, avec aucun indice. Rien. Dcp, j'ai réussi à faire aucun exercice parce que même chat GPT n'est pas parvenu à résoudre un seul de ces exercices. Même moi j'arrivais pas à discuter avec chat GPT parce qu'on ne se comprenais pas. Dcp, réveil à 8h30 pour rien. De plus, il y avait grève des enseignants aujourd'hui ainsi que jour férier demain (armistice). Donc 80% du pays faisait le pont sauf les écoles supérieurs. Clc, Cours lundi que pour 2h de cours."
        },
        {
            "titre": "diner avec Mathis",
            "tags": ["genant","kot","diner"],
            "texte": "bah voila, genant comme d'habitude. Je suis descendu diner au kot et il n'y avait personne. Après oeu de temps, mathis est descendu. Et la, quand mathis descend, c'est un combat pour trouver un sujet de discussion. Les 10 dernières minutes, j'ai même pas parlé tellement y avait rien à dire. Le \"Aurevoir\" était génant."
        },
        {
            "titre": "Colis LDLC",
            "tags": ["clc"],
            "texte": "Mon colis est enfin arrivé chez LDLC. Pour ceux qui n'ont pas suivi. J'ai commandé 2 colis chez LDLC. J'ai tenté de les faire livrer au Night and Day à Namur, mais quand je suis arrivé pour réclamé mon colis, ils m'ont gentillement expliqué que je pouvais aller me faire foutre parce qu'ils ne récupère pas les colis de DPD. Donc j'ai décidé de me faire livrer au kot le lendemain vu qu'il me le proposait pour demain sur leur site. Mais ils ne sont jamais passé. Je suis resté 1h15 devant la porte du kot comme un con. Ensuite DPD a décidé de renvoyer mon colis à LDLC à la place de me proposer un autre RDV. Heureusement LDLC a prévu ce genre de truc, ils me le renvoie à une nouvelle adresse. Ils viennent de recevoir les colis."
        }
    ]
}
