{
  "histoire": [
    {
      "titre": "Problème Windows et réinstallation sur le fixe",
      "tags": ["clc","ordinateur"],
      "texte": "Bordel de merde. Je viens de passer 4 heures à réparer mon PC tour parce que je ne sais quoi n'allait plus. Ca a commencé il y a 2 jours. Mon partage de connexion n'allait plus. J'ai du demander à chat GPT parce que qui d'autre, je n'ai pas les compétences pour et pas l'argent pour aller voir un professionnel. Il m'a expliqué comment réactivé mon partage WIFI à l'aide des services Windows. Ensuite le PC a commencé à freeze sans raison alors que je n'avais que quelques fenêtres d'ouverte et particulièrement avec PyCharm. Moi ca ne marangeait pas parce que je devais travailler. Bref, aujourd'hui c'était plus possible. Je lui ai demandé quoi faire en lui expliquant bien la situation et les symptomes. Il ma demandé de faire quelques test. C'est la que j'ai remarqué que je ne pouvais même plus lancé de jeux trop volumineux. Plus je tentais des choses et plus les choses allaient de moins en moins bien. Il m'a finalement dit de réinstaller Windows tout en gardant les données. Ce que j'ai fait en téléchargeant l'ISO de Windows 11. J'ai monté le fichier et j'ai lancé le programme setup.exe pour faire l'installation. La première fois n'a pas fonctionnée parce qu'il est resté bloqué sur la fenêtre de téléchargement des mises à jour. Donc j'ai débranché le câble Ethernet. Ensuite j'ai réessayer et ça a fonctionné. Fenêtre bleue et installation. Une fois terminé, il a lancé la fenêtre noire comme si il allait me demandé de paramétrer Windows. Sur le coup j'ai eu un peu peur, parce que sans réfléchir j'ai lancé l'installation sans vraiment vérifier que mes fichiers serait intact à la fin. Mais tout est la, ou à l'air d'être la. Bref sacré histoire. Tellement d'écrans de chargement que j'ai fais au moins 20 parties de Rocket League. Je suis pas mauvais mais maintenant je dois travailler."
    },
    {
      "titre": "Le cul a Emma Mouli",
      "tags": ["kot","fille"],
      "texte": "Ce soir j'ai encore vu le cul à Emma Mouli au souper. Aller pas croire, elle était habillée, mais qu'est-ce que ça donne bien dans un jogging. Des fois je me demande pourquoi ce n'est pas moi, et puis je vois la PP de son tel avec son mec et je sais pourquoi. Bref, un délice mais qu'on ne touche qu'avec les yeux. (J'espère que personne ne tombera jamais sur cette note)"
    }
  ]
}