{
    "histoire": [
        {
            "titre": "Impossible de travailler à l'école",
            "tags": [
                "ecole"
            ],
            "texte": "Alors ca c'est drôle et ça me CLC. Ce matin, je me suis réveillé à 7h30. 7H30 ! Pour aller en cours. Ca fait 3 semaines que j'ai cours, c'est la deuxième fois que j'ai réussi à me lever à 8h30. Pour vous dire l'exploit. J'ai été dormir à 1h du mat en plus (DORMIR, donc il a encore fallu que je m'endorme). Soit. Je suis donc parvenu à aller en cours. C'était le premier labo de Sécurité des Réseaux. J'arrive en même temps que le prof, etc. Tout bien. Je m'installe seul (on est 6, les autres attendaient ailleurs). Le prof explique le cours, il explique ce qu'on va faire durant les 4h, etc. Puis je vais me rasseoir à ma place, et la, ... je commence à installer le matériel. Je voulais utilisé mon portable pour Chat GPT et le PC de l'école pour la manipulation. J'allume le PC de l'école, et la je vois qu'il a pas Internet. Bon soit, je fais encore l'effort d'essayé de changer les câbles Ethernet, etc. Vous voyez déjà le truc. Y a 2 câble Ethernet sur le PC... Le truc à une configuration qu'il vaut mieux pas toucher. Je vais même voir dans le panneau de contrôle, mais rien à faire. J'abandonne. Donc je passe sur le portable pour tout faire. Bien vite, je me rends compte que j'ai pas pris ma souris avec... Bon, la c'est de ma faute. Pour me détendre, j'allume mon casque histoire d'écouter de la bonne musique, et la, j'ai la notification des 10% de batterie pour la 6ème fois. Je comprends que faire les 4h pou mon casque, ça va être compliqué. Je regarde la batterie de mon portable dans l'action, et je vois qu'il a pas beaucoup de batterie. Je veux prendre mon chargeur, mais avant même d'ouvrir mon sac, je comprends que je l'ai laissé au kot (ça me va pas de me lever tôt...). Donc, faisons le point sur tout ça. J'ai une tour sans Internet, un casque sans batterie, un portable qui va me lâché dans 10 minutes et je me suis levé tôt pour rien... Le bon point la dedans c'est que sur 6, il y avait une fille plutôt mignonne qui est entrée (je n'irai jamais lui parlé) et que pour la partie 2 du labo, il faut être 2. Mais bon, dans 30 minutes je suis parti. Pis y a une autre fille qui est entrée, mais beaucoup moins ... . Elle à un charisme pour 10 à elle toute seule. Dommage qu'on puisse pas mettre d'image, je vous aurais mis une comparaison. 30 min plus tard elle est partie, et je me suis rendu compte que c'était plus une pétasse qu'autre chose."
        }
    ]
}